app/views/users/index.html.erb

SELECT COUNT(*) FROM "recipes" WHERE "recipes"."user_id" = ?  [["user_id", 1]]
---
              <div class="content">
                投稿数：<%= user.recipes.count %>