app/controllers/recipes_controller.rb

INSERT INTO "recipes" ("user_id", "title", "body", "image_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @recipe = Recipe.new(recipe_params)
    @recipe.user_id = current_user.id
    if @recipe.save

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @recipe = Recipe.find(params[:id])

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "recipes" SET "body" = ?, "updated_at" = ?, "image_id" = ? WHERE "recipes"."id" = ?  [["body", "1　ニンニクスライスを炒める。\r\n2　豚を炒める。\r\n3　醤油、味の素を加える。"], ["updated_at", "2020-08-16 16:02:45.074075"], ["image_id", "8892b4185796ad3670c8e62da2b607a4a51f0b4fc6ec71dba1ddfceeadb3"], ["id", 1]]
---
  def update
    @recipe = Recipe.find(params[:id])
    if @recipe.update(recipe_params)